# 練習問題1 
# [Shift][→]で<name>を選択して
# [Ctrl][d]を必要な回数押そう
# [→]か[←]を押した上で自分の名前に変えよう
# ショートカットなし：一個ずつ選んで編集、選ぶたびに数ミリのカーソルの調整
# ショートカットあり：正確に選択し、まとめて編集できる
print("Hello, <name>")
print("My name is <name>")
print("<name> likes programming")

# 練習問題2
# [Alt][↓]か[Alt][↑]を用いて昇順に入れ替えよう
# ショートカットなし：中身を書き直すもしくは行ごとコピペ
# ショートカットあり：簡単に入れ替わる
print(5)
print(2)
print(4)
print(3)
print(1)

# 練習問題3
# [Shift][Alt][↑]か[Shift][Alt][↓]で行ごと複製しよう
# ショートカットなし：行選択してコピペ
# ショートカットあり：選択せずに複製できる
print("この行を複製しよう")

# 練習問題4
# コードを実行するために[Ctrl][/]でコメントアウトしよう
# ショートカットなし：言語によって異なるコメントアウトの記号を調べる
# ショートカットあり：コメントアウトの記号調べなくていい
# 自己紹介のコード
# def introduce()
    # introduce()

# 練習問題5
# [Ctrl][J]でターミナルを開こう
# ショートカットなし：エディターと下の青い部分の境目のカーソルの数ミリの調整が必要
# ショートカットあり：調整不要
# ファイルのパスをコピーして、python <ファイルのパス>で実行しよう
